DeviceProcessEvents
| where ((FolderPath endswith "\\powershell.exe" or FolderPath endswith "\\pwsh.exe") or (ProcessVersionInfoOriginalFileName in~ ("PowerShell.EXE", "pwsh.dll"))) and (ProcessCommandLine contains " -e " or ProcessCommandLine contains " -E " or ProcessCommandLine contains " -ec " or ProcessCommandLine contains " -EC " or ProcessCommandLine contains " -enc" or ProcessCommandLine contains " -Enc" or ProcessCommandLine contains " -ENC" or ProcessCommandLine contains " -encodedcommand" or ProcessCommandLine contains " -EncodedCommand")
