DeviceProcessEvents
| where (ProcessVersionInfoOriginalFileName in~ ("Cmd.Exe", "PowerShell.EXE", "pwsh.dll", "wscript.exe", "cscript.exe", "MSHTA.EXE", "RUNDLL32.EXE", "REGSVR32.EXE", "CertUtil.exe")) and (not(((ProcessVersionInfoOriginalFileName =~ "Cmd.Exe" and FolderPath endswith "\\cmd.exe") or (ProcessVersionInfoOriginalFileName =~ "PowerShell.EXE" and FolderPath endswith "\\powershell.exe") or (ProcessVersionInfoOriginalFileName =~ "pwsh.dll" and FolderPath endswith "\\pwsh.exe") or (ProcessVersionInfoOriginalFileName =~ "wscript.exe" and FolderPath endswith "\\wscript.exe") or (ProcessVersionInfoOriginalFileName =~ "cscript.exe" and FolderPath endswith "\\cscript.exe") or (ProcessVersionInfoOriginalFileName =~ "MSHTA.EXE" and FolderPath endswith "\\mshta.exe") or (ProcessVersionInfoOriginalFileName =~ "RUNDLL32.EXE" and FolderPath endswith "\\rundll32.exe") or (ProcessVersionInfoOriginalFileName =~ "REGSVR32.EXE" and FolderPath endswith "\\regsvr32.exe") or (ProcessVersionInfoOriginalFileName =~ "CertUtil.exe" and FolderPath endswith "\\certutil.exe"))))
