DeviceProcessEvents
| where (FolderPath endswith "\\mshta.exe" and (ProcessCommandLine contains "http://" or ProcessCommandLine contains "https://" or ProcessCommandLine contains "vbscript" or ProcessCommandLine contains "javascript")) or (FolderPath endswith "\\rundll32.exe" and (ProcessCommandLine contains "javascript:" or ProcessCommandLine contains "http://" or ProcessCommandLine contains "https://"))
